src/SSL.Chat2Desk/src/InformationRegisters/C2D_ОповещенияОператоров/C2D_ОповещенияОператоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_ОповещенияОператоров</name>
  <resources>
    <name>Оповещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Operator_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Клиенты/C2D_Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Клиенты</name>
  <resources>
    <name>Клиент</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>avatar</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>assigned_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>client_phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяТипаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Операторы/C2D_Операторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Операторы</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>avatar</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>first_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>last_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Диалоги/C2D_Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Диалоги</name>
  <resources>
    <name>state</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>operator_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>client_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>transport</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/CommonForms/ЧатКлиент/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = Пользователи.ТекущийПользователь(); 
	СписокЧатов.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если мобильныйКлиент Тогда
	    Элементы.ГруппаОсновная.Вид = 	
	#КонецЕсли 
	ЭтаФорма.КлючУникальности ="c2d";
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "C2D_ОбновитьСписокЧатов" Тогда
		Если Элементы.СписокЧатов.ТекущиеДанные = Неопределено или не элементы.СписокЧатов.ТекущиеДанные.свойство("dialog_id") Тогда
			Возврат;
		КонецЕсли;

		ПометитьПрочитаным(Элементы.СписокЧатов.ТекущиеДанные.dialog_id, Элементы.СписокЧатов.ТекущиеДанные.operator_id);
		Элементы.СписокЧатов.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЧаты
&НаКлиенте
Процедура СписокЧатовПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокЧатов.ТекущиеДанные = Неопределено или не элементы.СписокЧатов.ТекущиеДанные.свойство("dialog_id") Тогда
		Возврат;
		Клиент = Неопределено;
	КонецЕсли;
	Если ЗначениеЗаполнено(Элементы.СписокЧатов.ТекущиеДанные.dialog_id) Тогда
		Если не Авторизован Тогда
			АвторизоватьсяВChat2desk();
			Если не авторизован Тогда
				АктивныйЧат =  "<!DOCTYPE html>
				|<html>
				|    <head>
				|        <title>Не удалось авторизоваться</title>
				|    </head>
				|    <body>
				|        <p>К сожалению, не удалось авторизоваться. Обратитесь к администратору</p>
				|    </body>
				|</html>";	
			Иначе
				Элементы.АктивныйЧат.Документ.cookie= cookie;
				АктивныйЧат = C2D_ВзаимодействиеСC2DКлиентСервер.ПолучитьСсылкуЧата(Элементы.СписокЧатов.ТекущиеДанные.dialog_id);
				Клиент = Элементы.СписокЧатов.ТекущиеДанные.Клиент;
				
			КонецЕсли; 			
		Иначе
			Элементы.АктивныйЧат.Документ.cookie= cookie;
			АктивныйЧат = C2D_ВзаимодействиеСC2DКлиентСервер.ПолучитьСсылкуЧата(Элементы.СписокЧатов.ТекущиеДанные.dialog_id);
			Клиент = Элементы.СписокЧатов.ТекущиеДанные.Клиент;
			
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АктивныйЧатДокументСформирован(Элемент)
	ПометитьПрочитаным(Элементы.СписокЧатов.ТекущиеДанные.dialog_id, Элементы.СписокЧатов.ТекущиеДанные.operator_id);
КонецПроцедуры

&НаКлиенте
Процедура ПометитьПрочитаным(dialog_id, operator_id)
	ДлительнаяОперация = ПометитьПрочитанымНаСервере(dialog_id, operator_id);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПометкиОПрочтении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершении);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПометитьПрочитанымНаСервере(dialog_id, operator_id)
	СтруктураПараметровМетода = новый Структура("dialog_id, operator_id", dialog_id, operator_id);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(новый УникальныйИдентификатор);
	возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.C2D_ОповещенияОператоров.БеседаПрочитанаВФоне", СтруктураПараметровМетода, ПараметрыВыполнения);
КонецФункции

&НаКлиенте
Процедура ПослеПометкиОПрочтении(Результат, ДополнительныеПараметры) экспорт
	 Элементы.СписокЧатов.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СопоставитьКлиента(Команда)
	Если Элементы.СписокЧатов.ТекущиеДанные = Неопределено или не элементы.СписокЧатов.ТекущиеДанные.свойство("dialog_id") Тогда
		Возврат;
	КонецЕсли;

	ПередаваемыеПараметры = Новый Структура; 
	
	ПередаваемыеПараметры.Вставить("ID",Элементы.СписокЧатов.ТекущиеДанные.client_id);
	
	ПараметрыМассив = Новый Массив;
	ПараметрыМассив.Добавить(ПередаваемыеПараметры); // помещаем структуру в массив
	КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.C2D_Клиенты", ПараметрыМассив); 
	ОткрытьФорму("РегистрСведений.C2D_Клиенты.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписиРегистра)); // передаем в форму ключ записи и открываем её
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуКлиента(Команда)
	Если Элементы.СписокЧатов.ТекущиеДанные = Неопределено или не элементы.СписокЧатов.ТекущиеДанные.свойство("dialog_id") Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ПолучитьКлиентаНаСервере(Элементы.СписокЧатов.ТекущиеДанные.Клиент));
КонецПроцедуры

&НаКлиенте
Процедура ПередатьЧат(Команда)
	Если Элементы.СписокЧатов.ТекущиеДанные = Неопределено или не элементы.СписокЧатов.ТекущиеДанные.свойство("dialog_id") Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.СписокЧатов.ТекущиеДанные;
	
	СписокОператоров = СформироватьСписокОператоровНаСервере();
	//Удалим текущего оператора
	СписокОператоров.Удалить(СписокОператоров.НайтиПоЗначению(ТекущиеДанные.operator_id));
	ДополнительныеПараметры = новый структура("dialog_id",ТекущиеДанные.dialog_id );
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВыбораОператора", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзСписка(ОписаниеОповещения,СписокОператоров);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораОператора(ЭлементСписка, ДополнительныеПараметры) Экспорт
	  Если  не ЭлементСписка = неопределено Тогда
	  	   ПередатьЧатНаСервере(ДополнительныеПараметры.dialog_id, ЭлементСписка.Значение);
	  КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьСписокОператоровНаСервере()
	Возврат РегистрыСведений.C2D_Операторы.СформироватьСписокОператоров();
КонецФункции

&НаСервере
Процедура ПередатьЧатНаСервере(dialog_id, operator_id)
	ЧатПередан = РегистрыСведений.C2D_Диалоги.ПередатьЧатДругомуОператору(dialog_id, operator_id);
	Если ЧатПередан Тогда
		Элементы.СписокЧатов.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКлиентаНаСервере(id)
	Возврат РегистрыСведений.C2D_Клиенты.НайтиСсылкуПоGUID(id);	
КонецФункции

&НаСервере
Процедура АвторизоватьсяВChat2desk()
	АдресСервера = C2D_ВзаимодействиеСApiПовтИсп.СерверВебДоступа();
	СруктураАдреса = C2D_ВзаимодействиеСApiСлужебный.РазобратьАдресСайта(АдресСервера);
	СоединениеHTTP = Новый HTTPСоединение(СруктураАдреса.HTTPСервер, 443, "", "",,, Новый ЗащищенноеСоединениеOpenSSL());		
	ЗапросHTTP = Новый HTTPЗапрос("api/user/sign_in");
	СтрокаАвторизации = РегистрыСведений.C2D_Операторы.ПолучитьТелоДанныхАвторизации(Пользователи.ТекущийПользователь());
	Если СтрокаАвторизации = "" Тогда
		Возврат;
	КонецЕсли;
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаАвторизации);
	Результат = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
	Если Результат.КодСостояния = 200 Тогда
		Cookie = Результат.заголовки.Получить("Set-Cookie");
		авторизован = Истина;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти
